###########################################################################
#
# Generated by : Version 10.1 Build 197 01/19/2011 Service Pack 1 SJ Full Version
#
# Project      : DE2_D5M
# Revision     : DE2_D5M
#
# Date         : Fri Apr 01 16:40:17 +0800 2011
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: CLOCK_50
create_clock -period "20.000 ns" \
             -name {CLOCK_50} {CLOCK_50}
# ---------------------------------------------

# ---------------------------------------------
#D5M				 
create_clock -period "50.0 MHZ" [get_ports GPIO_1[16]]
create_clock -period "50.0 MHZ" [get_ports GPIO_1[0]]
# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------




# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------
# QSF: -name TSU_REQUIREMENT 4 ns -from * -to *
set_max_delay 4 -from [get_ports *] -to [get_registers {rCCD_DATA[*]}]
# QSF: -name TSU_REQUIREMENT 4 ns -from * -to rCCD_FVAL
set_max_delay 4 -from [get_ports *] -to [get_registers {rCCD_FVAL}]
# QSF: -name TSU_REQUIREMENT 4 ns -from * -to rCCD_LVAL
set_max_delay 4 -from [get_ports *] -to [get_registers {rCCD_LVAL}]
# QSF: -name TSU_REQUIREMENT 1 ns -from DRAM_DQ -to *
set_max_delay 1 -from [get_ports {DRAM_DQ[*]}] -to [get_registers *]


# ** Tco/MinTco requirements
#    -----------------------
# --------------
# Represent unkown external clock as N/C (Not a Clock)
create_clock -name "N/C" -period 10.0
# --------------
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to Sdram_Control_4Port:u6|mDATAOUT
set_output_delay 0.0 -clock "N/C" [get_ports {Sdram_Control_4Port:u6|mDATAOUT}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {Sdram_Control_4Port:u6|mDATAOUT}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to Sdram_Control_4Port:u11|mDATAOUT
set_output_delay 0.0 -clock "N/C" [get_ports {Sdram_Control_4Port:u11|mDATAOUT}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {Sdram_Control_4Port:u11|mDATAOUT}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to CCD_Capture:u3|mCCD_DATA
set_output_delay 0.0 -clock "N/C" [get_ports {CCD_Capture:u3|mCCD_DATA[*]}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {CCD_Capture:u3|mCCD_DATA[*]}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to CCD_Capture:u3|Pre_FVAL
set_output_delay 0.0 -clock "N/C" [get_ports {CCD_Capture:u3|Pre_FVAL}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {CCD_Capture:u3|Pre_FVAL}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to CCD_Capture:u3|mCCD_LVAL
set_output_delay 0.0 -clock "N/C" [get_ports {CCD_Capture:u3|mCCD_LVAL}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {CCD_Capture:u3|mCCD_LVAL}]
# QSF: -name TCO_REQUIREMENT 1 ns -from VGA_Controller:u1|oVGA_BLANK -to oVGA_BLANK_N
set_output_delay 0.0 -clock "N/C" [get_ports {oVGA_BLANK_N}]
set_max_delay 1 -from [get_keepers {VGA_Controller:u1|oVGA_BLANK}] -to [get_ports {oVGA_BLANK_N}]
# QSF: -name TCO_REQUIREMENT 1 ns -from VGA_Controller:u1|oVGA_G -to oVGA_G
set_output_delay 0.0 -clock "N/C" [get_ports {oVGA_G}]
set_max_delay 1 -from [get_keepers {VGA_Controller:u1|oVGA_G[*]}] -to [get_ports {oVGA_G}]
# QSF: -name TCO_REQUIREMENT 1 ns -from VGA_Controller:u1|oVGA_H_SYNC -to oVGA_HS
set_output_delay 0.0 -clock "N/C" [get_ports {oVGA_HS}]
set_max_delay 1 -from [get_keepers {VGA_Controller:u1|oVGA_H_SYNC}] -to [get_ports {oVGA_HS}]
# QSF: -name TCO_REQUIREMENT 1 ns -from VGA_Controller:u1|oVGA_R -to oVGA_R
set_output_delay 0.0 -clock "N/C" [get_ports {oVGA_R}]
set_max_delay 1 -from [get_keepers {VGA_Controller:u1|oVGA_R[*]}] -to [get_ports {oVGA_R}]
# QSF: -name TCO_REQUIREMENT 1 ns -from VGA_Controller:u1|oVGA_V_SYNC -to oVGA_VS
set_output_delay 0.0 -clock "N/C" [get_ports {oVGA_VS}]
set_max_delay 1 -from [get_keepers {VGA_Controller:u1|oVGA_V_SYNC}] -to [get_ports {oVGA_VS}]
# QSF: -name TCO_REQUIREMENT 1 ns -from VGA_Controller:u1|oVGA_B -to oVGA_B
set_output_delay 0.0 -clock "N/C" [get_ports {oVGA_B}]
set_max_delay 1 -from [get_keepers {VGA_Controller:u1|oVGA_B[*]}] -to [get_ports {oVGA_B}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to DRAM_DQ
set_output_delay 0.0 -clock "N/C" [get_ports {DRAM_DQ[*]}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {DRAM_DQ[*]}]



# ---------------------------------------------

